app/controllers/admin/questions_controller.rb

SELECT "questions".* FROM "questions"
---
	def index
		@question = Question.all

SELECT  "questions".* FROM "questions" WHERE "questions"."id" = ? LIMIT 1  [["id", 6]]
UPDATE "questions" SET "question" = ?, "updated_at" = ? WHERE "questions"."id" = ?  [["question", "Wat is je favoriete fruit?"], ["updated_at", "2015-05-26 11:26:07.659799"], ["id", 6]]
---
	def update
		@question = Question.find(params[:id])
		@question.update(question_params)