app/controllers/chapters_controller.rb

SELECT "chapters".* FROM "chapters"
---
	def index
		@chapter = Chapter.all

INSERT INTO "chapters" ("chapter", "created_at", "updated_at") VALUES (?, ?, ?)  [["chapter", "1. leren lesgeven"], ["created_at", "2015-05-22 13:48:34.043278"], ["updated_at", "2015-05-22 13:48:34.043278"]]
---
	def create
		chapter = Chapter.new(chapter_params)
		chapter.save

SELECT  "chapters".* FROM "chapters" WHERE "chapters"."id" = ? LIMIT 1  [["id", 1]]
---
	def edit
		@chapter = Chapter.find(params[:id])

SELECT  "chapters".* FROM "chapters" WHERE "chapters"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "chapters" SET "chapter" = ?, "updated_at" = ? WHERE "chapters"."id" = ?  [["chapter", "1. leren lesgeven2"], ["updated_at", "2015-05-22 13:48:38.356525"], ["id", 1]]
---
	def update
		@chapter = Chapter.find(params[:id])
		@chapter.update(chapter_params)

SELECT  "chapters".* FROM "chapters" WHERE "chapters"."id" = ? LIMIT 1  [["id", 1]]
DELETE FROM "chapters" WHERE "chapters"."id" = ?  [["id", 1]]
---
	def destroy
		@chapter = Chapter.find(params[:id])
		@chapter.destroy