app/controllers/questions_controller.rb

SELECT "questions".* FROM "questions"
---
	def index
		@question = Question.all

INSERT INTO "questions" ("question", "created_at", "updated_at") VALUES (?, ?, ?)  [["question", "Jalla jallan"], ["created_at", "2015-05-22 11:37:02.890367"], ["updated_at", "2015-05-22 11:37:02.890367"]]
---
	def create
		question = Question.new(question_params)
		question.save